1С_EDT_ДомашняяРабота/src/Documents/дм_Доставка/дм_Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>дм_Доставка</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1С_EDT_ДомашняяРабота/src/Documents/дм_Доставка/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
   
	// Анкета клиента
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "АнкетаКлиента";
    КомандаПечати.Представление = НСтр("ru = 'Анкета клиента'");
    КомандаПечати.Порядок = 5;  
    
	// Транспортная накладная
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "ТранспортнаяНакладная";
    КомандаПечати.Представление = НСтр("ru = 'Транспортная накладная'");
    КомандаПечати.Порядок = 10; 
    
    // Комплект документов
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "АнкетаКлиента,ТранспортнаяНакладная";
    КомандаПечати.Представление = НСтр("ru = 'Комплект документов'");
    КомандаПечати.Порядок = 100 ;   
    
    // Договор на доставку (Документ формата .docx)
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "УправлениеПечатью";
    КомандаПечати.Идентификатор = "Документ.дм_Доставка.ПФ_DOC_ДоговорНаДоставку";
    КомандаПечати.Представление = НСтр("ru = 'Договор на доставку формат .DOCX'");
    КомандаПечати.Порядок = 150;

    
КонецПроцедуры 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АнкетаКлиента");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАнкетаКлиента(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Анкета клиента'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.дм_Доставка.ПФ_MXL_АнкетаКлиента";
    КонецЕсли; 
    
    ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ТранспортнаяНакладная");
    Если ПечатнаяФорма <> Неопределено Тогда
        ПечатнаяФорма.ТабличныйДокумент = ПечатьТранспортнаяНакладная(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Транспортная накладная'");
        ПечатнаяФорма.ПолныйПутьКМакету = "Документ.дм_Доставка.ПФ_MXL_ТранспортнаяНакладная";
    КонецЕсли; 
    
КонецПроцедуры 


 
#КонецОбласти




#Область СлужебныеПроцедурыИФункции
Процедура ВывестиЗаголовок(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьЗаголовокДокумента = Макет.ПолучитьОбласть("Заголовок");
	
	ДанныеПечати = Новый Структура;
	
	ШаблонЗаголовка = "Транспортная накладная № %1 от %2";
	ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
		Формат(ДанныеДокументов.Дата, "ДЛФ=DD")); 
    ТекстГрузоотправитель = "Грузоотпровитель: "+ДанныеДокументов.Организация;
    ТекстГрузополучатель = "Грузополучатель: "+ДанныеДокументов.Контрагент;
	ДанныеПечати.Вставить("ЗаголовокДокумента", ТекстЗаголовка); 
	ДанныеПечати.Вставить("Грузоотправитель", ТекстГрузоотправитель); 
	ДанныеПечати.Вставить("Грузополучатель", ТекстГрузополучатель); 
    
	ОбластьЗаголовокДокумента.Параметры.Заполнить(ДанныеПечати);  
    
    // QR    
    
    СтрокаСсылки = ПолучитьНавигационнуюСсылку(ДанныеДокументов.Ссылка);
    
    ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(СтрокаСсылки, 1, 120); 
    
    Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
        ТекстСообщения = НСтр("ru = 'Не удалось сформировать QR-код.
        |Технические подробности см. в журнале регистрации.'");
        ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
    Иначе
        КартинкаQRКода = Новый Картинка(ДанныеQRКода);
        ОбластьЗаголовокДокумента.Рисунки.QRКод.Картинка = КартинкаQRКода;
    КонецЕсли;	
    
    // QR
    
	ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
	
КонецПроцедуры  
Процедура ВывестиОбластьДокументаАнкеты(ДанныеДокументов, ТабличныйДокумент, Макет)
    
    ОбластьПечатиДокумента = Макет.ПолучитьОбласть("ОбластьДокументаАнкеты");
    
    ДанныеПечати = Новый Структура;
    
    ШаблонЗаголовка = "Анкета о доставке %1 от %2";
    ЗаголовокДокумента = СтрШаблон(ШаблонЗаголовка,
    ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
    Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
    ДанныеПечати.Вставить("ЗаголовокДокумента", ЗаголовокДокумента); 
    ОбластьПечатиДокумента.Параметры.Заполнить(ДанныеПечати);  
    
    // QR    
    
    СтрокаСсылки = ПолучитьНавигационнуюСсылку(ДанныеДокументов.Ссылка);
    
    ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(СтрокаСсылки, 1, 120); 
    
    Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
        ТекстСообщения = НСтр("ru = 'Не удалось сформировать QR-код.
        |Технические подробности см. в журнале регистрации.'");
        ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
    Иначе
        КартинкаQRКода = Новый Картинка(ДанныеQRКода);
        ОбластьПечатиДокумента.Рисунки.QRКод.Картинка = КартинкаQRКода;
    КонецЕсли;	
    
    // QR
    
	ТабличныйДокумент.Вывести(ОбластьПечатиДокумента);
	
КонецПроцедуры    
Процедура ВывестиПодвал(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");

	ТабличныйДокумент.Вывести(ОбластьПодвала);
	
КонецПроцедуры
Процедура ВывестиТовары(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаТовары = ДанныеДокументов.Товары.Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаТовары);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры 
Функция ПолучитьДанныеДокументов(МассивОбъектов)

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
                   |    дм_Доставка.Ссылка КАК Ссылка,
                   |    дм_Доставка.Номер КАК Номер,
                   |    дм_Доставка.Дата КАК Дата,
                   |    дм_Доставка.Организация КАК Организация,
                   |    дм_Доставка.Контрагент КАК Контрагент,
                   |    дм_Доставка.Договор КАК Договор,
                   |    дм_Доставка.Ответственный КАК Ответственный,
                   |    дм_Доставка.Товары.(
                   |        Ссылка КАК Ссылка,
                   |        НомерСтроки КАК НомерСтроки,
                   |        Номенклатура КАК Номенклатура,
                   |        Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
                   |        Количество КАК Количество
                   |    ) КАК Товары
                   |ИЗ
                   |    Документ.дм_Доставка КАК дм_Доставка
                   |ГДЕ
                   |    дм_Доставка.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции
Функция ПечатьАнкетаКлиента(МассивОбъектов, ОбъектыПечати) 
    
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АнкетаКлиента";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.дм_Доставка.ПФ_MXL_АнкетаКлиента");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь; 
        
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

        ВывестиОбластьДокументаАнкеты(ДанныеДокументов, ТабличныйДокумент, Макет); 
        
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);		
		
	КонецЦикла;	
		
	Возврат ТабличныйДокумент;
    
    
КонецФункции   
Функция ПечатьТранспортнаяНакладная(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ТранспортнаяНакладная";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.дм_Доставка.ПФ_MXL_ТранспортнаяНакладная");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь; 
        //
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
        //
        ВывестиЗаголовок(ДанныеДокументов, ТабличныйДокумент, Макет); 
        //
        ВывестиТовары(ДанныеДокументов, ТабличныйДокумент, Макет);
        //
        ВывестиПодвал(ДанныеДокументов, ТабличныйДокумент, Макет);
        //
        //// В табличном документе необходимо задать имя области, в которую был 
        //// выведен объект. Нужно для возможности печати комплектов документов. 
        
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);		
		
	КонецЦикла;	
		
	Возврат ТабличныйДокумент;
	

КонецФункции     

#КонецОбласти
